.metadata/.plugins/org.eclipse.core.resources/.history/80/00597aaf2625001e1a09c1bcca3e5826

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<definitions xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:ns="http://www.opentravel.org/OTA/2003/05" xmlns:tns="http://www.copaair.com/services/trn/crm/passengerprofile-abstract" xmlns:xsd="http://www.w3.org/2001/XMLSchema" targetNamespace="http://www.copaair.com/services/trn/crm/passengerprofile-abstract">
    <import location="../../../../../../Resources/Schema/OTA_PassengerProfile_RQ_RS.xsd" namespace="http://www.opentravel.org/OTA/2003/05"/>
    <message name="GetRequest">
        <part element="ns:OTA_ReadRQ" name="parameter"/>
    </message>
    <message name="GetResponse">
        <part element="ns:OTA_ProfileReadRS" name="parameter"/>
    </message>
    <message name="ValidateDataForFFAssignmentRequest">
        <part element="ns:COPA_ValidateDataForFFAssignmentRQ" name="parameter"/>
    </message>
    <message name="ValidateDataForFFAssignmentResponse">
        <part element="ns:COPA_ValidateDataForFFAssignmentRS" name="parameter"/>
    </message>
    <portType name="PassengerProfile">
        <operation name="Get">
            <input message="tns:GetRequest"/>
            <output message="tns:GetResponse"/>
        </operation>
        <operation name="GetLight">
            <input message="tns:GetRequest"/>
            <output message="tns:GetResponse"/>
        </operation>
        <operation name="ValidateDataForFFAssignment">
            <input message="tns:ValidateDataForFFAssignmentRequest"/>
            <output message="tns:ValidateDataForFFAssignmentResponse"/>
        </operation>
    </portType>
</definitions>
