atibd/certification/ReadRQ_nocancellable.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.opentravel.org/OTA/2003/05">
<soap:Header/>
<soap:Body>
    <ns1:OTA_ReadRQ Version="1.3">
        <ns1:ReadRequests>
            <ns1:ReadRequest>
                <ns1:UniqueID ID="6066652"></ns1:UniqueID>
            </ns1:ReadRequest>
        </ns1:ReadRequests>
    </ns1:OTA_ReadRQ>
</soap:Body>
</soap:Envelope>