resources/parsexml.xml

<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
  </soap:Header>
  <soap:Body>
    <OTA_ReadRQ xmlns="http://www.opentravel.org/OTA/2003/05" TimeStamp="2018-11-10T14:16:01.000-04:00" Target="Production" Version="4.0" PrimaryLangID="en-us">
    </OTA_ReadRQ>
  </soap:Body>
</soap:Envelope>